Repository: HansonStudio/Stories
Catalog: Stories/Stories/Resources/*.lproj/Localizable.strings
Languages: ca, es

# interactiveThirty
source: I was just saying that, even though I know this is not the best app, I just wanted to show the animations, the transitions and more importantly, the code behind it.
ca: Només estava dient que, tot i que aquesta app no sigui la millor, només volia alguna cosa que mostrar, ensenyar animacions, transicions i el més important, el codi darrera.
es: Lo que estaba diciendo es que, a pesar de que esta app no sea la mejor, solo quería mostrar las animaciones, transiciones y más importante, el código que hay detrás.

# interactiveThirtyOne
source: And, rather than show you an app done in months, show you what I’m capable of, solving a challange.
ca: I, per no mostrar una app feta en mesos, mostrar-vos del que sóc capaç, poder solucionar un problema de manera ràpida.
es: Y no enseñaros una app hecha en meses, pero enseñaros de lo que soy capaz, solucionar problemas.

# interactiveThirtyOneOne
source: Great
ca: Perfecte
es: Perfecto

# interactiveThirtyOneTwo
source: Right but...
ca: Ja, però...
es: Ya pero...

# interactiveThirtyTwo
source: I know what you are going to say, there are awesome applicants too, but don’t worry, I just wanted to have a presentation card, something to be proud of done in just a week.
ca: Ja sé el que vas a dir, hi ha persones que han presentat la app que són increïbles, però no et preocupis, nomès volia tenir una carta de presentació, alguna cosa de la que estar orgullos fet en nomes una setmana.
es: Ya se lo que vas a decir, hay otras aplicaciones que son brutales, pero no te preocupes, solo quería tener una carta de presentación, una cosa de la que estar orgulloso hecho en una semana.

# interactiveThirtyThree
source: Push my limits.
ca: Sortir de la meva 'comfort zone'
es: Salir de mi 'comfort zone'

# interactiveThirtyFour
source: To be honest, I just hope to see you in June and that you enjoyed this story.
ca: Per ser-te sincer, només espero veure't al Juny i que t'hagi agradat aquesta història.
es: Para serte sincero, solo espero verte en junio y que hayas disfrutado de la app.

# interactiveThirtyFive
source: ... I'm losing a bit the connection, maybe it's time to close it and let you explore the rest of this app.
ca: ... Perdo la connexió, potser es moment de tancar aquesta ràdio i així deixar-te explorar la resta de l'aplicació.
es: ... Pierdo un poco la conexión, me parece que es momento de cerrar la conexión y dejarte explorar la app un poco.

# interactiveThirtySix
source: Oh, before I disconnect this! Do you want to see how this ends?
ca: Oh, abans de que desconnecti, vols mirar el final?
es: Oh! Antes de que desconecte, quieres ver el final de la historia?

# interactiveThirtySixOne
source: Show me!
ca: Ensenya!
es: Enseña!

# interactiveThirtySixTwo
source: Of course!
ca: Clar!
es: Claro!
