Repository: HansonStudio/Stories
Catalog: Stories/Stories/Resources/*.lproj/Localizable.strings
Languages: ca, es

source: Welcome
ca: Benvingut
es: Bienvenido

# connectingEstablishing
source: Establishing connection...
ca: Establint connexió...
es: Establiendo connexión...

# connectingConnected
source: Connected.
ca: Connectat.
es: Connectado.

# menuFullStory
source: Read the full story
ca: Llegeix tota la història
es: Lee toda la historia

# menuBackStory
source: Go back to the story
ca: Torna a la història
es: Vuelve a la historia

# menuReadMotivation
source: Read the motivation
ca: Llegeix el manifest
es: Lee la motivación

# menuWatchTheEnd
source: Watch the end
ca: Mira el final
es: Mira el final

# menuFindGithub
source: Find me in GitHub
ca: Troba'm a GitHub
es: Encuéntrame en GitHub

# menuContact
source: Contact me
ca: Contacta'm
es: Contáctame

# accessibilityMenuTitle
source: Menu
ca: Menú
es: Menú

# accessibilityMoonTitle
source: Moon
ca: Lluna
es: Luna

# accessibilityMenuHint
source: In this menu you'll be able to navigate across the app.
ca: En aquest menú seràs capaç de navegar per tota l'aplicació.
es: En este menú vas a ser capaç de navegar por la aplicación.

# accessibilityStoryHint
source: Listen my story in a table view.
ca: Escolta la meva història en una table view.
es: Escucha mi historia en una table view.

# accessibilityMotivationHint
source: Listen my motivation in a table view.
ca: Escolta la meva motivació en una table view.
es: Escucha mi motivación en una table view.

# accessibilityBackHint
source: Go back to the interactive story.
ca: Torna a la història interactiva.
es: Vuelve a la historia interactiva.

# accessibilityEndHint
source: Go to the end of the story.
ca: Ves al final de la meva història.
es: Ve al final de la historia.

# accessibilityGitHubHint
source: Go to my GitHub account.
ca: Ves a la meva conta de GitHub.
es: Ve a mi cuenta en GitHub.

# accessibilityContactHint
source: Contact me through an email.
ca: Contacta'm via email.
es: Contáctame por email.

# accessibilityMoonHint
source: This is the moon, which is the conductor through all the app.
ca: Aquesta és la lluna, la conductora de tota l'aplicació.
es: Esta es la luna, la conductora de toda la aplicación.

# accessibilityFirstOptionHint
source: The first option in the bottom left part of the iPhone to answer the question in the middle.
ca: La primera opció que contesta la pregunta proposada a la meitat de la pantalla.
es: La primera opción que responde la pregunta del medio de la pantalla.

# accessibilitySecondOptionHint
source: The second option in the bottom right part of the iPhone to answer the question in the middle.
ca: La segona opció que contesta la pregunta proposada a la meitat de la pantalla.
es: La segunda opción que responde la pregunta del medio de la pantalla.

# accessibilityRestartHint
source: Start over to answer read the story in the app.
ca: Torna a començar la història interactiva.
es: Volver a empezar la historia interactiva.

# storiesSubtitleTouch
source: The interactive story
ca: La història interactiva
es: La historia interactiva

# storyTitleTouch
source: Story
ca: Història
es: Historia

# storySubtitleTouch
source: My story
ca: La meva història
es: Mi historia

# motivationTitleTouch
source: Motivation
ca: Manifest
es: Motivación

# motivationSubtitleTouch
source: My motivation
ca: El meu manifest
es: Mi motivación

# menuTitleTouch
source: Menu
ca: Menú
es: Menú

# menuSubtitleTouch
source: Go to the menu
ca: Ves al menú
es: Ves al menú

# contactTitle
source: Hello there!
ca: Hola hola!
es: Hola hola!

# contactMessage
source: Hey! We've liked your application!
ca: Ei! Ens ha agradat la teva applicació
es: Hey! Nos ha gustado tu aplicación

# contactErrorTitle
source: Oooops!
ca: Uuuuups!
es: Uuuuups!

# contactErrorMessage
source: It seems that you don't have mail configured in your phone, but you can still send me a message to ramon.gilabert.llop[at]gmail.com
ca: Sembla que no tens mail configurat al telèfon, però em pots enviar un missatge a ramon.gilabert.llop[at]gmail.com
es: Parece que no tienes configurada la aplicación de correo, pero me puedes enviar un mensaje a ramon.gilabert.llop[at]gmail.com

# contactErrorButton
source: Ok
ca: Val

# storyTitle
source: This is my story
ca: La meva història
es: Esta es mi historia

# storyMessage
source: Rather than explain who am I like I did before, or like my resumé does, I'd like to explain to you today why I'm doing this, why this app is what it is, what I've done what I've done. This story starts a couple of weeks ago, I just woke up and I had a new email from Apple in my phone, it was about the WWDC, as fast as I could I went to check the scholarship terms, this was the last year I could do that, I was really excited. When I entered there, the whole world turned down to me... I didn't have an app to show, I didn't have time to build one, what should I do? I started contacting my friends around the world to pitch ideas, a guy from Portugal, a person from Catalonia, another from Australia... Together we came out with an idea to make an app for celiac people, as my sister and me, to explain people what it is like to or to eat Gluten Free products, put ResearchKit in it and make a kick ass app in just 2 weeks... After that, though, I started thinking, I was working, so didn't have much more time to put on it, but still, when I got home, I wasn't convinced at all. To explain my disease to the world I wanted to do something great, I couldn't do it in a week spending some afternoons... I was desperate, I started drawing some stuff, I was worried because I couldn't show you Lights, my biggest side project yet, since it includes hardware. But then it hit me.
ca: Per comptes d'explicar qui sóc com vaig fer l'any passat, o com ho faria el meu currículum, avui vull explicar perquè estic fent el que faig, perquè vaig decidir de fer aquesta app. Aquesta història comença un parell de setmanes endarrera quan, justament quan m'acabava de despertar vaig rebre un correu electrònic d'Apple informant de la WWDC. Tant ràpid com vaig poder vaig anar a veure com em podria presentar com a 'scolarship' ja que, aquest any era l'últim que podria fer-ho, en tenia moltes ganes. Quan vaig entrar però, el món em va caure als peus... No tenia cap app per ensenyar en la que hagués treballat durant mesos, tampoc tenia temps per fer-ne una, que podia fer? Vaig començar a contactar a amics d'arreu del món per tenir idees junts, una persona de Portugal, persones de Catalunya i un d'Austràlia...n Junts, vam arribar a la conclusió de fer una app per celíacs com la meva germana i jo, per explicar a la gent com es la vida d'una persona que menja sense gluten, posar 'ResearchKit' i fer una app espectacular en 2 setmanes... Després d'això, però, vaig començar a pensar-hi, no tenia massa temps, ja que estava treballant, però igualment no n'estava massa convençut. Per explicar la celiaquia al món volia fer una cosa espectacular de veritat, no podia dedicar-hi només unes quantes tardes... Estava desesperat, vaig començar a dibuixar algunes coses, tenia una mica de por, no podia ensenyar Lights, el meu projecte personal més gran ja que inclou hardware... Però en aquell moment ho vaig veure clar.

# storyConclusion
source: Instead of showing you an app done in months, why I don't explain you the story of why I did one app in a week, a challange, show you what I'm capable of, show you that I can do this, that the most beautiful thing Apple has done is not 3D touch, or Live Photos, but Swift, that Swift is capable of this and much more, and that's why I want to be there in the WWDC, to be able to keep explaining my story.
ca: Per comptes de mostrar-vos una app feta en mesos, perquè no explicar la història d'una app feta en algunes tardes durant una setmana? Un rempte, mostrar-vos del que sóc capaç, mostrar-vos que puc fer això, que la cosa més bonica que Apple ha creat recentment no és 3D touch o Live Photos, és Swift, i que Swift es capaç d'això i de molt molt més, i aquesta és la raó per la que vull estar a la WWDC aquest any, per poder continuar explicant la meva història.

# storyFooter
source: The moon I saw the day I came out with the idea.
ca: La lluna que vaig veure el dia que vaig entendre la idea.

# motivationTitle
source: The motivation
ca: El manifest
es: Mi motivación

# motivationMessage
source: Fusce dapibus, tellus ac cursus commodo, tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus. Duis mollis, est non commodo luctus, nisi erat porttitor ligula, eget lacinia odio sem nec elit. Sed posuere consectetur est at lobortis. Nullam id dolor id nibh ultricies vehicula ut id elit. Nulla vitae elit libero, a pharetra augue. Maecenas sed diam eget risus varius blandit sit amet non magna. Nullam quis risus eget urna mollis ornare vel eu leo. Aenean eu leo quam. Pellentesque ornare sem lacinia quam venenatis vestibulum. Donec ullamcorper nulla non metus auctor fringilla. Duis mollis, est non commodo luctus, nisi erat porttitor ligula, eget lacinia odio sem nec elit. Aenean lacinia bibendum nulla sed consectetur. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Vivamus sagittis lacus vel augue laoreet rutrum faucibus dolor auctor. Integer posuere erat a ante venenatis dapibus posuere velit aliquet.
ca: Durant mesos he estat treballant més de 14 hores al dia en diferents projectes, universitat, feina, projectes personals, tesis, ha sigut un any de bojos, nova ciutat, nova gent, nova cultura. Des de l'any passat, des del passat Abril quan vaig presentar la passada app, moltes coses han canviat. Ara estic 100% en Swift, he deixat Objective C i he començat molt més seriosament en disseny, he començat a contribuïr cada vegada més en Open Source i finalment, vaig decidir de fer el meu framework d'animacions, que encara està en beta, tot i que aquesta app el fa servir, contribuïr a projectes d'altra gent i estar involucrat cada vegada mes en la indústria... Amb aquesta app el que mostro és el que més m'agrada, animacions, transicions, disseny, Swift en estat pur. Amb aquest app també mostro la meva evolució des de l'any passat en disseny, més net, clar, fàcil i, en la meva opinió, simple.
es: For months I've been working more than 14 hours a day in different projects, university, work, side, thesis, it's been a crazy ride this year, new city, new people, new culture. Since last year, since the last April when I presented the app, a lot of stuff has changed. I dived 100% into Swift ditching Objective C, I started to do more and more design, more and more Open Source, I finally decided to do my Open Source animation framework, which is still in beta and being used in this app, started to contribute and help other people, started to be involved more and more into the industry... With this app, I show you what I like the most, animations, transitions, Swift in it's pure state. With this app I also show you the evolution of my design since last year, cleaner, simpler, easier and, in my opinion, better.

# motivationConclusion
source: Etiam porta sem malesuada magna mollis euismod. Nullam quis risus eget urna mollis ornare vel eu leo. Nullam id dolor id nibh ultricies vehicula ut id elit. Etiam porta sem malesuada magna mollis euismod. Praesent commodo cursus magna, vel scelerisque nisl consectetur et.
ca: Vaig rebre el missatge de l'scolarship un parell de setmanes endarrera, amb 3 deadlines sobre meu però, tot i així, volia intentar fer-ho de totes maneres, sortir de la meva comfort zone i construir una cosa bonica en unes quantes tardes. Gràcies per la seva atenció i que tingueu una molt bona WWDC. Ramon Gilabert
es: I got the email of the scholarship a couple of weeks ago, with 3 deadlines on top of me, but still, I wanted to challange myself and explain the story of why, and that is is it. Thank you for your attention and have a really nice WWDC. Ramon Gilabert

# motivationFooter
source: Etiam porta sem malesuada magna mollis euismod.
ca: El paisatge que veia cada tarda quan arribava a casa i havia de fer l'aplicació.
es: The landscape I saw every afternoon when I got home and I had to build the app.

# finaleTitle
source: Thank you for your time, let’s have a nice WWDC… Together.
ca: Gràcies pel teu temps. Tinguem una bona WWDC... Junts.
es: Gracias por su tiempo. Vamos a tener una buena WWDC... Juntos.

# finaleButton
source: Restart
ca: Recomençar
es: Reempezar

# interactiveFirst
source: Hey, is somebody there?
ca: Hola! Hi ha algú aquí?
es: Ei! Hay alguien ahí?

# interactiveFirstOne
source: Yes I'm here!
ca: Sí, aquí!
es: Si, aquí!

# interactiveFirstTwo
source: Who is this?
ca: Qui ets?
es: Quien es?

# interactiveSecond
source: Oh great! Great to hear! Finally! It’s been almost a year since the last time we spoke!
ca: Oh perfecte! Que bé sentir això! Ha passat pràcticament un any des de la última vegada que vam parlar!
es: Perfecto! Que bien oír eso! Ha pasado aproximadamente un año des de la última vez que hablamos!

# interactiveThird
source: You probably don’t remember me! I’m Ramon! How crazy is this? I’ve been waiting you for weeks!
ca: Probablement ni em recordis! Sóc en Ramon! Això es de bojos! He estat esperant aquest moment moltes setmanes!
es: Probablemente no me recuerdes! Soy Ramon, eso es de locos! He estado esperándote durante semanas!

# interactiveFourth
source: I have a lot to tell you, but I’m far away, and this sort of radio that I’m using is kind of wacky! Do you want to hear the story?
ca: Tinc moltes coses a explicar-te, però estic molt lluny i aquesta mena de ràdio que estic fent servir funciona una mica malament... Vols sentir la història?
es: Tengo mucho que contarte, pero estoy lejos, y la radio que uso es un poco desastre, quieres oír la historia?

# interactiveFourthOne
source: Of course
ca: Sí!
es: Claro

# interactiveFourthTwo
source: Nah. It's fine.
ca: No, tranquil
es: Nah...

# interactiveFive
source: Great! Well this has taken me a long while to figure out, and I’m not even awake enough to tell you the whole story, but I’ll try, this past couple of months have been crazy.
ca: Perfecte! Bé, això m'ha portat un temps d'assentar i no estic el suficientment despert per explicar-te tota la història, per tant, seré breu. Aquest parell de mesos han sigut de bojos.
es: Perfecto! Me ha llevado un poco de tiempo de entenderlo, y no estoy suficientemente despierto como para explicarte toda la historia, pero seré breve, estos últimos meses han sido de locos.

# interactiveSix
source: What do you mean it's fine? I’ve been waiting to tell my story for 2 months now, how can you just 'be fine'!
ca: Què vols dir no, tranquil? He estat esperant aquest moment per explicar-te la història com a dos mesos, com pots dir-me 'no, tranquil'!
es: Que quieres decir que estas bien? He estado esperando a contarte mi historia durante 2 meses, y ahora me dices que 'nah'!

# interactiveSeven
source: Let’s see again, do you want to hear the story?
ca: A veure, tornem-ho a provar, vols sentir la història?
es: Vamos a ver otra vez, quieres oír la historia?

# interactiveSevenOne
source: All right!
ca: Val, val!
es: Venga va!

# interactiveSevenTwo
source: Sure...
ca: Bé...
es: Vale...

# interactiveEight
source: You don’t seem that happy about the story it, but anyways...
ca: No sembles massa convençut, però bé...
es: No pareces demasiado excitado, pero vamos...

# interactiveNine
source: Great! Well this has been a crazy process and I’m not even awake enough to tell you the whole story, but I’ll make it short. This past couple of months have been crazy.
ca: Perfecte! Bé, això m'ha portat un temps d'assentar i no estic el suficientment despert per explicar-te tota la història, per tant, seré breu. Aquest parell de mesos han sigut de bojos.
es: Perfecto! Me ha llevado un poco de tiempo de entenderlo, y no estoy suficientemente despierto como para explicarte toda la historia, pero seré breve, estos últimos meses han sido de locos.

# interactiveNineOne
source: Oh really?
ca: Ah si?
es: Ah si?

# interactiveNineTwo
source: Right.
ca: Si
es: Ya.

# interactiveTen
source: Yes, really! To be honest, I had too much to do...
ca: Sí! Si et sóc sincer, tenia massa coses a fer...
es: Si! Para serte sincero, tenía demasiadas cosas a hacer.

# interactiveEleven
source: I’ve been like 10 months combining work, university and a thesis that I’m doing that is going to be really, really nice!
ca: He estat durant els últims 10 mesos combinant treball, universitat i una tesis que estic fent que penso que serà, o ja és brutal!
es: Han sido como 10 meses combinando trabajo, universidad y una tesis que estoy haciendo que me parece que va a ser increíble.

# interactiveElevenOne
source: 10 months?
ca: 10 mesos?
es: 10 meses?

# interactiveElevenTwo
source: A thesis?
ca: Una tesis?
es: Una tesis?

# interactiveTwelve
source: Well yes, since the work started. The thesis has been for 4 months, though, so it hasn’t been that bad.
ca: Bé si, des de que la feina va començar, la tesis han sigut 4 mesos però, vull dir, no ha estat tant malament en general.
es: Bueno, si, des de que el trabajo empezó. La tesis han sido 4 meses, por tanto no ha sido tan horrible.

# interactiveThirteen
source: It’s actually the most interesting thing I’m doing right now. It’s called Lights! Sounds so meta, doesn’t it?
ca: Realment, és una de les coses més interessants que he fet últimament, es diu Lights!, sona molt retro, no?
es: Es muy interesante realmente, se llama Lights! Es muy retro, verdad?

# interactiveThirteenOne
source: Sure
ca: Sí!
es: Si

# interactiveThirteenTwo
source: It does...
ca: Sona...
es: Suena...

# interactiveFourteen
source: It combines both my knowledge in design, computer science and electronics, to create an app, a couple of servers that talk to each other, some hardware and more!
ca: Combina els meus coneixements en disseny, desenvolupament i electrònica per crear una app, dos servidors que parlen entre ells, una mica de hardware i molt més!
es: Combina mi conocimiento en diseño, programación y electrónica para crear una app, dos servidores que hablan entre ellos y un poco de hardware.

# interactiveFourteenOne
source: Tell more!
ca: Vull més!
es: Más!

# interactiveFourteenTwo
source: So WWDC...
ca: Mmm. WWDC.
es: Mmm. WWDC.

# interactiveFifteen
source: It has basically 6 different programming languages in order for it to work, and it's so smooth and fast, since the servers are done in JavaScript and using sockets that I'm really impressed!
ca: Sí! Té bàsicament 6 llenguatges de programació diferents per tal de fer-ho servir, i funciona súper ràpid i finament, ja que els servidors estan fets en JS i fent servir sockets, estic bastant impressionat.
es: Tiene 6 lenguajes diferentes de programación para que funcione, y va súper rápido, ya que usa JavaScript y sockets. Estoy bastante impresionado.

# interactiveSixteen
source: The way it works is, you change the light status in your phone, it sends a socket to the cloud, the cloud processes that change and it sends it to the Raspberry Pi.
ca: La manera que funciona és bàsicament, tu canvies la llum des del telèfon, aquest envia un socket al núvol, aquest processa el canvi i li envia a la Raspberry Pi.
es: De la manera que funciona es bàsicamente, tu cambias las luces en tu móbil, este habla con la nube, la nube lo procesa y lo envía a una Raspberry Pi.

# interactiveSeventeen
source: But there’s more! After that, the Raspberry Pi sends it via Bluetooth to a light with an Arduino.
ca: Però encara hi ha més! Després d'això, la Raspberry Pi envia via Bluetooth a una llum amb Arduino la informació.
es: Pero hay más! Después de eso, la Raspberry Pi envía un mensaje Bluetooth a la luz en un Arduino con la información.

# interactiveSeventeenTwo
source: Nice!
ca: Que guai!
es: Guay!

# interactiveNineteen
source: All right, all right!
ca: Gràcies! Gràcies! Però suficient sobre això, anem a parlar de la WWDC.
es: Gracias! Gracias! Pero bueno, ya basta de eso, vamos a hablar de la WWDC.

# interactiveEighteen
source: Thank you! Thank you! But enough about that, let’s talk WWDC here.
ca: Bé, bé, bé!
es: Bueno! Bueno!

# interactiveTwenty
source: How do you see this app? Be careful, I’m tracking what you input!
ca: Com veus tu aquesta app? Ves en compte, estic monitoritzant el que dius.
es: Como ves esta app? Ten cuidado, estoy recogiendo lo que dices.

# interactiveTwentyTwo
source: Nah! I’m totally kidding, I don’t know what you tap, but I hope you tap in the right button!
ca: Nah! Menteixo, no sé que estas apretant, però espero que apretis al botó correcte.
es: Nah! Es una broma, no sé que aprietas, pero supongo que estas apretando en el botón correcto.

# interactiveTwentyTwoOne
source: It's promising.
ca: Promet.
es: Está bien!

# interactiveTwentyTwoTwo
source: Dunno yet.
ca: No sé...
es: No sé.

# interactiveTwentyThree
source: I mean, I know you just tapped '%@', but I’m not monitoring from home this conversation that we are having...
ca: Vull dir, ja sé que acabes d'apretar '%@', però no estic monitoritzant aquesta conversa des de casa...
es: Quiero decir, ya sé que acabas de apretar en '%@', pero no estoy viendo esto des de casa...

# interactiveTwentyFour
source: Or am I?
ca: O si?
es: O si?

# interactiveTwentyFive
source: Anyways. The story is basically that I had no idea on what to make... And to be honest I found it a bit unfair since I couldn’t show you Lights, which is my biggest side project yet...
ca: Peró bé, la història és bàsicament que no sabia que fer... I per ser-te sincer, vaig torbar una mica injust no poder ensenyar Lights, el meu projecte personal més gran...
es: Pero bueno. La historia es básicamente que no sabía que hacer... Y para serte sincero, encontré un poco injusto que no pudiera enseñaros Lights, mi mayor proyecto personal últimamente.

# interactiveTwentyFiveOne
source: Sure
ca: Ja.
es: Ya

# interactiveTwentyFiveTwo
source: Right
ca: Si.
es: Entiendo

# interactiveTwentySix
source: So basically I wanted to tell you with this app, and you guys at Apple, that the best thing you’ve done recently is Swift.
ca: Bàsicament el que et volia dir amb aquesta app, a tu i a Apple en general, que la millor cosa que heu fet recentment és Swift.
es: Básicamente, lo que quería decir con esta app, a ti y a Apple en general, es que lo mejor que han hecho recientemente es Swift.

# interactiveTwentySeven
source: No API can top that, Swift is fast, easy and beautiful and can do stuff like this app in just a matter of days.
ca: Cap API pot atrapar a Swift, és ràpid, fàcil i bonic, i pot fer coses com aquesta app en només uns dies.
es: Ninguna API puede superar eso, Swift es rápido, fácil y bonito, y puede hacer cosas como esta app en solo unos días.

# interactiveTwentyEight
source: To do this app I had just some afternoons over the course of a week, and...
ca: Per fer aquesta app nomès he disposat d'algunes tardes en el curs d'una setmana...
es: Para hacer esta app solo tuve algunas tardes durante el curso de una semana... Y...

# interactiveTwentyEightOne
source: What?
ca: Que?
es: Que?

# interactiveTwentyEightTwo
source: Keep going
ca: Segueix
es: Sigue

# interactiveTwentyNine
source: No nothing, I’m just emotional...
ca: No, res, només que em fico sensible...
es: No, nada, que me pongo un poco sensible...
